//Задача 3
//Программа на вход принимает число и выдаёт, является ли число чётным.
int num01=-3;

if(num01%2 ==0)
{
    Console.WriteLine(num01 + " - четное");
}
else
{
    Console.WriteLine(num01 + " - нечетное");
}
